lecture02/simulations/05TJunctionGasWithBaffleMembraneAndSHM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          multicomponentFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20.0;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1e-1;

maxDeltaT       1e-1;

libs            ( "libspecieTransfer.so" );

functions
{

    #includeFunc patchFlowRateInlet
    
    #includeFunc patchFlowRateOutlet1
    
    #includeFunc patchFlowRateOutlet2        

    #includeFunc residuals
    
};

// ************************************************************************* //
