lecture02/simulations/05TJunctionGasWithBaffleMembraneAndSHM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (-0.01 -0.01 -0.01) 	// 0
    (0.22 -0.01 -0.01)	    // 1
    (0.22 0.12 -0.01)	    // 2
    (-0.01 0.12 -0.01)	    // 3
    (-0.01 -0.01 0.02)	    // 4
    (0.22 -0.01 0.02) 	    // 5
    (0.22 0.12 0.02)	    // 6
    (-0.01 0.12 0.02)	    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (115 65 15) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }    
    topWall
    {
        type wall;
        faces
        (
            (6 2 3 7)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }    
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
