lecture02/simulations/05TJunctionGasWithBaffleMembraneAndSHM/0/N2.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{

    membraneLeft
    {
        type            semiPermeableBaffleMassFraction;
        samplePatch     membraneRight;
        c               1e-8;
        property        massFraction;
        value           $internalField;
    }

    membraneRight
    {
        type            semiPermeableBaffleMassFraction;
        samplePatch     membraneLeft;
        c               1e-8;
        property        massFraction;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    outlet1
    {
        type            zeroGradient;        
    }
    
    outlet2
    {
        type            zeroGradient;        
    }    

    walls
    {
        type            zeroGradient;
    }    

    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
